In [1]:
import pandas as pd

In [2]:
s = pd.Series([3,5,6,0,2])
s

0    3
1    5
2    6
3    0
4    2
dtype: int64

In [3]:
s = pd.Series([3,5,6,0,2],index=range(20,25))
s

20    3
21    5
22    6
23    0
24    2
dtype: int64

In [4]:
s = pd.Series([3,5,6,0,2],index=['a','b','c','d','e'])
s

a    3
b    5
c    6
d    0
e    2
dtype: int64

In [5]:
data = {'a':0.,'b':1.,'c':2.}
s = pd.Series(data,index=['b','a','d','c'])
s

b    1.0
a    0.0
d    NaN
c    2.0
dtype: float64

In [6]:
s['b']

1.0

In [7]:
import numpy as np

In [8]:
df1 = pd.DataFrame(np.random.rand(6,4),columns=list('ABCD'))
df1

          A         B         C         D
0  0.043307  0.212313  0.628908  0.709697
1  0.948703  0.559119  0.268116  0.211661
2  0.248073  0.090203  0.747353  0.068113
3  0.522848  0.915560  0.503532  0.919555
4  0.298190  0.376551  0.363441  0.940532
5  0.938039  0.893153  0.980225  0.744501

In [9]:
df2 = pd.DataFrame(np.random.randn(6,4),columns=list('ABCD'))
df2

          A         B         C         D
0 -0.782298  0.548065 -0.483682 -0.404581
1 -0.116362 -0.077178  0.417928 -0.321163
2  1.963029 -0.098015 -0.432123 -0.288994
3 -1.750118  1.351749  0.178283 -0.128786
4  0.500741 -0.754570 -0.734262 -1.692003
5  1.866750  1.197502 -0.396137 -1.454220

In [11]:
df1 = df1.append(df2,ignore_index=True)
df1

           A         B         C         D
0   0.043307  0.212313  0.628908  0.709697
1   0.948703  0.559119  0.268116  0.211661
2   0.248073  0.090203  0.747353  0.068113
3   0.522848  0.915560  0.503532  0.919555
4   0.298190  0.376551  0.363441  0.940532
5   0.938039  0.893153  0.980225  0.744501
6  -0.782298  0.548065 -0.483682 -0.404581
7  -0.116362 -0.077178  0.417928 -0.321163
8   1.963029 -0.098015 -0.432123 -0.288994
9  -1.750118  1.351749  0.178283 -0.128786
10  0.500741 -0.754570 -0.734262 -1.692003
11  1.866750  1.197502 -0.396137 -1.454220
12 -0.782298  0.548065 -0.483682 -0.404581
13 -0.116362 -0.077178  0.417928 -0.321163
14  1.963029 -0.098015 -0.432123 -0.288994
15 -1.750118  1.351749  0.178283 -0.128786
16  0.500741 -0.754570 -0.734262 -1.692003
17  1.866750  1.197502 -0.396137 -1.454220

In [12]:
df1 = df1.drop(list(range(2,8)))
df1

           A         B         C         D
0   0.043307  0.212313  0.628908  0.709697
1   0.948703  0.559119  0.268116  0.211661
8   1.963029 -0.098015 -0.432123 -0.288994
9  -1.750118  1.351749  0.178283 -0.128786
10  0.500741 -0.754570 -0.734262 -1.692003
11  1.866750  1.197502 -0.396137 -1.454220
12 -0.782298  0.548065 -0.483682 -0.404581
13 -0.116362 -0.077178  0.417928 -0.321163
14  1.963029 -0.098015 -0.432123 -0.288994
15 -1.750118  1.351749  0.178283 -0.128786
16  0.500741 -0.754570 -0.734262 -1.692003
17  1.866750  1.197502 -0.396137 -1.454220

In [13]:
df1 = df1.drop(columns=['A','D'])
df1

           B         C
0   0.212313  0.628908
1   0.559119  0.268116
8  -0.098015 -0.432123
9   1.351749  0.178283
10 -0.754570 -0.734262
11  1.197502 -0.396137
12  0.548065 -0.483682
13 -0.077178  0.417928
14 -0.098015 -0.432123
15  1.351749  0.178283
16 -0.754570 -0.734262
17  1.197502 -0.396137

In [14]:
df1 = df1.drop(11)
df1

           B         C
0   0.212313  0.628908
1   0.559119  0.268116
8  -0.098015 -0.432123
9   1.351749  0.178283
10 -0.754570 -0.734262
12  0.548065 -0.483682
13 -0.077178  0.417928
14 -0.098015 -0.432123
15  1.351749  0.178283
16 -0.754570 -0.734262
17  1.197502 -0.396137

In [16]:
df1.columns

Index(['B', 'C'], dtype='object')

In [17]:
data = [{'A': 1,'B': 2},
       {'A': 5,'B': 10,'C': 20},
       {'B': 20,'C': 5,'D': 22}]

In [18]:
df = pd.DataFrame(data,columns = list('ABCD'),index = ['r0','r1','r2']) #column行的索引 ; index列的索引
print(df)

      A   B     C     D
r0  1.0   2   NaN   NaN
r1  5.0  10  20.0   NaN
r2  NaN  20   5.0  22.0

In [19]:
print(df.loc['r0']) #列的索引(名稱)切割

A    1.0
B    2.0
C    NaN
D    NaN
Name: r0, dtype: float64

In [20]:
print(df.iloc[1]) #列的index切割

A     5.0
B    10.0
C    20.0
D     NaN
Name: r1, dtype: float64

In [21]:
print(df['B']) #欄的切割

r0     2
r1    10
r2    20
Name: B, dtype: int64

In [22]:
print(df.loc['r1':'r2','C':'D']) #列與欄的slice

       C     D
r1  20.0   NaN
r2   5.0  22.0

In [23]:
df = pd.DataFrame(np.random.randint(1,100,24).reshape(6,4),columns=list('ABCD'))
print(df)

    A   B   C   D
0  63  60  49  87
1  12  35  23  53
2  33  69  69  76
3   4  78   6  24
4   1  89  76  34
5  62   5  23  67

In [24]:
df[3:5]

   A   B   C   D
3  4  78   6  24
4  1  89  76  34

In [26]:
df.iloc[3:5]

   A   B   C   D
3  4  78   6  24
4  1  89  76  34

In [30]:
df[['A','B','D']]

    A   B   D
0  63  60  87
1  12  35  53
2  33  69  76
3   4  78  24
4   1  89  34
5  62   5  67

In [29]:
df[df.C >50]

    A   B   C   D
2  33  69  69  76
4   1  89  76  34

In [31]:
pwd

'C:\\Users\\ctsld\\PycharmProjects\\Anaconda_project'

In [78]:
df = pd.read_csv('C:\\Users\\ctsld\\PycharmProjects\\Anaconda_project\\item.csv',delimiter=',',index_col=0,header=0)
df

        item  amount
id
1     #apple      20
2    ora#nge      30
3   bananan#      40

In [33]:
df.index

Int64Index([1, 2, 3], dtype='int64', name='id')

In [34]:
df.columns

Index(['item', 'amount'], dtype='object')

In [79]:
df['item'] = df.item.astype('str')

In [40]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3 entries, 1 to 3
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   item    3 non-null      object
 1   amount  3 non-null      int64
dtypes: int64(1), object(1)
memory usage: 72.0+ bytes

In [80]:
df

        item  amount
id
1     #apple      20
2    ora#nge      30
3   bananan#      40

In [81]:
df[df['item'].str.contains('^#')]

      item  amount
id
1   #apple      20

In [90]:
df[df['item'].str.contains('^#')].item.str.replace('^#','')

id
1    apple
Name: item, dtype: object

In [76]:
df.item = df[df['item'].str.contains('^#')]

In [92]:
df['item'] = df.item.str.replace('^#','')

In [98]:
df['price'] = [30,40,50]

In [99]:
df

        item  amount  price
id
1      apple      20     30
2    ora#nge      30     40
3   bananan#      40     50

In [102]:
new=pd.DataFrame({'item':'pitch',
                  'amount':15,
                  'price':35
                  },
                 index=[4])
new

    item  amount  price
4  pitch      15     35

In [105]:
new1=pd.DataFrame({'item':'apple',
                  'amount':15,
                  'price':35
                  },
                 index=[5])
new1

    item  amount  price
5  apple      15     35

In [109]:
df1=df1.append(new1,ignore_index=True)
df1

       item  amount  price
0     apple      20     30
1   ora#nge      30     40
2  bananan#      40     50
3     pitch      15     35
4     apple      15     35

In [117]:
df1.loc[4,'price'] = 30
df1

       item  amount  price
0     apple      20     40
1   ora#nge      30     40
2  bananan#      40     50
3     pitch      15     35
4     apple      15     30

In [118]:
df1.groupby('item').sum()

          amount  price
item
apple         35     70
bananan#      40     50
ora#nge       30     40
pitch         15     35

In [123]:
df2 = df1.groupby('item').sum()
df2

          amount  price
item
apple         35     70
bananan#      40     50
ora#nge       30     40
pitch         15     35

In [124]:
df2['totla'] = df2['amount'] * df2['price'] /df2['amount']

In [125]:
df2

          amount  price  totla
item
apple         35     70   70.0
bananan#      40     50   50.0
ora#nge       30     40   40.0
pitch         15     35   35.0

In [127]:
df2['占比'] = df2['totla']/195

In [135]:
df2.sort_values("totla", ascending=False,inplace=True)

In [136]:
df2

          amount  price  totla        占比
item
apple         35     70   70.0  0.358974
bananan#      40     50   50.0  0.256410
ora#nge       30     40   40.0  0.205128
pitch         15     35   35.0  0.179487